# Start Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContourSettingItem..::..Start Property
ContourSettingItem Class See Also
---
The contour range start elevation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double Start { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Start As Double
	Get
```

Visual C++
---
```text
public:
property double Start {
	double get ();
}
```

# See Also
ContourSettingItem Class
Autodesk.Revit.DB Namespace